Revit 2027 API
BuiltInFailures.AssemblyFailures.CouldNotAcquireAssemblyViews Property
 The assembly instance could not acquire the assembly views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotAcquireAssemblyViews { get; }
Public Shared ReadOnly Property CouldNotAcquireAssemblyViews As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotAcquireAssemblyViews {
	FailureDefinitionId^ get ();
}
static member CouldNotAcquireAssemblyViews : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace